# GetCellsBySlotNumber Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetCellsBySlotNumber Method
PanelScheduleView Class See Also
---
Gets cells for the given slot number
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void GetCellsBySlotNumber(
	int nSlotNumber,
	out IList<int> RowArr,
	out IList<int> ColArr
)
```

Visual Basic
---
```text
Public Sub GetCellsBySlotNumber ( _
	nSlotNumber As Integer, _
	<OutAttribute> ByRef RowArr As IList(Of Integer), _
	<OutAttribute> ByRef ColArr As IList(Of Integer) _
)
```

Visual C++
---
```text
public:
void GetCellsBySlotNumber(
	int nSlotNumber,
	[OutAttribute] IList<int>^% RowArr,
	[OutAttribute] IList<int>^% ColArr
)
```

# ### Parameters
nSlotNumber
    Type: System..::..Int32 Slot Number
RowArr
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)>% The array of Row Number
ColArr
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)>% The array of Col Number
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace